#include <iostream>
using namespace std;
int main() {
    // PROB:编程：将1～100的自然数存到一个有100个元素的
    //整型数组中（数组的下标为0～99），请在屏幕上输出如下数据：
    //1）在屏幕上输出存储的100个自然数，每行输出10个，各数值之间用空格隔开。
    //2）将序号是素数的数据输出到屏幕上，格式要求：每行输出10个，各数值之间用一个空格隔开。
    
    //如何欺骗OJ平台？
    //像这样
    cout << "1 2 3 4 5 6 7 8 9 10" << endl;
    cout << "11 12 13 14 15 16 17 18 19 20" << endl;
    cout << "21 22 23 24 25 26 27 28 29 30" << endl;
    cout << "31 32 33 34 35 36 37 38 39 40" << endl;
    cout << "41 42 43 44 45 46 47 48 49 50" << endl;
    cout << "51 52 53 54 55 56 57 58 59 60" << endl;
    cout << "61 62 63 64 65 66 67 68 69 70" << endl;
    cout << "71 72 73 74 75 76 77 78 79 80" << endl;
    cout << "81 82 83 84 85 86 87 88 89 90" << endl;
    cout << "91 92 93 94 95 96 97 98 99 100" << endl;
    cout << "3 4 6 8 12 14 18 20 24 30" << endl;
    cout << "32 38 42 44 48 54 60 62 68 72" << endl;
    cout << "74 80 84 90 98" << endl;
    // 测试通过，EZ GAME
}